app/controllers/uri_query_controller.rb

	def index
		@players = []

		page_url = "https://uva.onlinejudge.org/index.php?option=com_onlinejudge&Itemid=20&page=show_authorstats&userid=718101"
		page = Nokogiri::HTML(open(page_url))

		@teste = page.xpath("//div[contains(@align, 'center')]/table/tr/td/h1/text()").collect {|node| node.text.strip}
		@player1 = Player.new(:submissions => @teste[0], :tried => @teste[1], :solved => @teste[2],
			:first_sub => @teste[3], :last_sub => @teste[4])
		@player1.save!
---
INSERT INTO "players" ("id", "name", "submissions", "tried", "solved", "first_sub", "last_sub", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"